RT-Thread/rt-thread/bsp/gd32/arm/libraries/GD32E50x_Firmware_Library/GD32E50x_standard_peripheral/Source/gd32e50x_dac.c
    return number;
}

/*!
    \brief      get the DAC flag
    \param[in]  dac_periph: DACx(x=0)
    \param[in]  flag: the DAC status flags, only one parameter can be selected which is shown
                as below:
      \arg        DAC_FLAG_DDUDR0: DAC_OUT0 DMA underrun flag
      \arg        DAC_FLAG_FIFOF0: DAC_OUT0 FIFO full flag
      \arg        DAC_FLAG_FIFOE0: DAC_OUT0 FIFO empty flag
      \arg        DAC_FLAG_FIFOOVR0: DAC_OUT0 FIFO overflow flag
      \arg        DAC_FLAG_FIFOUDR0: DAC_OUT0 FIFO underflow flag
      \arg        DAC_FLAG_DDUDR1: DAC_OUT1 DMA underrun flag
      \arg        DAC_FLAG_FIFOF1: DAC_OUT1 FIFO full flag
      \arg        DAC_FLAG_FIFOE1: DAC_OUT1 FIFO empty flag
      \arg        DAC_FLAG_FIFOOVR1: DAC_OUT1 FIFO overflow flag
      \arg        DAC_FLAG_FIFOUDR1: DAC_OUT1 FIFO underflow flag
    \param[out] none
    \retval     the state of DAC bit(SET or RESET)
*/
FlagStatus dac_flag_get(uint32_t dac_periph, uint32_t flag)
{
    if(flag & DAC_STAT_FLAG_MASK0)
    {
        /* check DAC_STAT0 flag */
        if(RESET != (DAC_STAT0(dac_periph) & flag))
        {
            return SET;
        }else{
            return RESET;
        }
    }else if(flag & DAC_STAT_FLAG_MASK1)
    {
        /* check DAC_STAT1 flag */
        if(RESET != (DAC_STAT1(dac_periph) & flag))
        {
            return SET;
        }else{
            return RESET;
        }
    }else{
        /* illegal parameters */
        return RESET;
    }
}

/*!
    \brief      clear the DAC flag
    \param[in]  dac_periph: DACx(x=0)
    \param[in]  flag: DAC flag
                one or more parameter can be selected which are shown as below:
      \arg        DAC_FLAG_DDUDR0: DACx_OUT0 DMA underrun flag
      \arg        DAC_FLAG_FIFOOVR0: DACx_OUT0 FIFO overflow flag
      \arg        DAC_FLAG_FIFOUDR0: DACx_OUT0 FIFO underflow flag
      \arg        DAC_FLAG_DDUDR1: DACx_OUT1 DMA underrun flag
      \arg        DAC_FLAG_FIFOOVR1: DACx_OUT1 FIFO overflow flag
      \arg        DAC_FLAG_FIFOUDR1: DACx_OUT1 FIFO underflow flag
    \param[out] none
    \retval     none
*/
void dac_flag_clear(uint32_t dac_periph, uint32_t flag)
{
    if(flag & DAC_STAT_FLAG_MASK0)
    {
        /* check DAC_STAT0 flag */
        DAC_STAT0(dac_periph) = (uint32_t)(flag & DAC_STAT_FLAG_MASK0);
    }else{
        /* illegal parameters */
    }

    if(flag & DAC_STAT_FLAG_MASK1)
    {
        /* check DAC_STAT1 flag */
        DAC_STAT1(dac_periph) = (uint32_t)(flag & DAC_STAT_FLAG_MASK1);
    }else{
        /* illegal parameters */
    }
}

/*!
    \brief      enable DAC interrupt
    \param[in]  dac_periph: DACx(x=0)
    \param[in]  interrupt: the DAC interrupt
                one or more parameter can be selected which are shown as below:
      \arg        DAC_INT_DDUDR0: DACx_OUT0 DMA underrun interrupt
      \arg        DAC_INT_FIFOOVR0: DACx_OUT0 FIFO overflow interrupt
      \arg        DAC_INT_FIFOUDR0: DACx_OUT0 FIFO underflow interrupt
      \arg        DAC_INT_DDUDR1: DACx_OUT1 DMA underrun interrupt
      \arg        DAC_INT_FIFOOVR1: DACx_OUT1 FIFO overflow interrupt
      \arg        DAC_INT_FIFOUDR1: DACx_OUT1 FIFO underflow interrupt
    \param[out] none
    \retval     none
*/
void dac_interrupt_enable(uint32_t dac_periph, uint32_t interrupt)
{
    if(interrupt & DAC_INT_EN_MASK0)
    {
        /* enable underrun interrupt */
        DAC_CTL0(dac_periph) |= (uint32_t)(interrupt & DAC_INT_EN_MASK0);
    }else{
        /* illegal parameters */
    }

    if(interrupt & DAC_INT_EN_MASK1)
    {
        /* enable FIFO overflow or underflow interrupt */
        DAC_CTL1(dac_periph) |= (uint32_t)(interrupt & DAC_INT_EN_MASK1);
    }else{
        /* illegal parameters */
    }
}

/*!
    \brief      disable DAC interrupt
    \param[in]  dac_periph: DACx(x=0)
    \param[in]  interrupt: the DAC interrupt
                one or more parameter can be selected which are shown as below:
      \arg        DAC_INT_DDUDR0: DACx_OUT0 DMA underrun interrupt
      \arg        DAC_INT_FIFOOVR0: DACx_OUT0 FIFO overflow interrupt
      \arg        DAC_INT_FIFOUDR0: DACx_OUT0 FIFO underflow interrupt
      \arg        DAC_INT_DDUDR1: DACx_OUT1 DMA underrun interrupt
      \arg        DAC_INT_FIFOOVR1: DACx_OUT1 FIFO overflow interrupt
      \arg        DAC_INT_FIFOUDR1: DACx_OUT1 FIFO underflow interrupt
    \param[out] none
    \retval     none
*/
void dac_interrupt_disable(uint32_t dac_periph, uint32_t interrupt)
{
    if(interrupt & DAC_INT_EN_MASK0)
    {
        /* disable underrun interrupt */
        DAC_CTL0(dac_periph) &= (uint32_t)(~(interrupt & DAC_INT_EN_MASK0));
    }else{
        /* illegal parameters */
    }

    if(interrupt & DAC_INT_EN_MASK1)
    {
        /* disable FIFO overflow or underflow interrupt */
        DAC_CTL1(dac_periph) &= (uint32_t)(~(interrupt & DAC_INT_EN_MASK1));
    }else{
        /* illegal parameters */
    }
}

/*!
    \brief      get the DAC interrupt flag
    \param[in]  dac_periph: DACx(x=0)
    \param[in]  int_flag: DAC interrupt flag
                only one parameter can be selected which is shown as below:
      \arg        DAC_INT_FLAG_DDUDR0: DACx_OUT0 DMA underrun interrupt flag
      \arg        DAC_INT_FLAG_FIFOOVR0: DACx_OUT0 FIFO overflow interrupt flag
      \arg        DAC_INT_FLAG_FIFOUDR0: DACx_OUT0 FIFO underflow interrupt flag
      \arg        DAC_INT_FLAG_DDUDR1: DACx_OUT1 DMA underrun interrupt flag
      \arg        DAC_INT_FLAG_FIFOOVR1: DACx_OUT1 FIFO overflow interrupt flag
      \arg        DAC_INT_FLAG_FIFOUDR1: DACx_OUT1 FIFO underflow interrupt flag
    \param[out] none
    \retval     the state of DAC interrupt flag(SET or RESET)
*/
FlagStatus dac_interrupt_flag_get(uint32_t dac_periph, uint32_t int_flag)
{
    uint32_t reg1 = 0U, reg2 = 0U;

    if(int_flag & DAC_INT_FLAG_MASK0)
    {
        /* check underrun interrupt int_flag */
        reg1 = DAC_STAT0(dac_periph) & int_flag;
        reg2 = DAC_CTL0(dac_periph) & int_flag;
    }else if(int_flag & DAC_INT_FLAG_MASK1)
    {
        /* check FIFO overflow and underflow interrupt int_flag */
        reg1 = DAC_STAT1(dac_periph) & int_flag;
        reg2 = DAC_CTL1(dac_periph) & int_flag;
    }else{
        /* illegal parameters */
    }

    /*get DAC interrupt flag status */
    if((RESET != reg1) && (RESET != reg2))
    {
        return SET;
    }else{
        return RESET;
    }
}

/*!
    \brief      clear the DAC interrupt flag
    \param[in]  dac_periph: DACx(x=0)
    \param[in]  int_flag: DAC interrupt flag
                one or more parameter can be selected which are shown as below:
      \arg        DAC_INT_FLAG_DDUDR0: DACx_OUT0 DMA underrun interrupt flag
      \arg        DAC_INT_FLAG_FIFOOVR0: DACx_OUT0 FIFO overflow interrupt flag
      \arg        DAC_INT_FLAG_FIFOUDR0: DACx_OUT0 FIFO underflow interrupt flag
      \arg        DAC_INT_FLAG_DDUDR1: DACx_OUT1 DMA underrun interrupt flag
      \arg        DAC_INT_FLAG_FIFOOVR1: DACx_OUT1 FIFO overflow interrupt flag
      \arg        DAC_INT_FLAG_FIFOUDR1: DACx_OUT1 FIFO underflow interrupt flag
    \param[out] none
    \retval     none
*/
void dac_interrupt_flag_clear(uint32_t dac_periph, uint32_t int_flag)
{
    /* clear underrun interrupt int_flag */
    if(int_flag & DAC_INT_FLAG_MASK0)
    {
        DAC_STAT0(dac_periph) = (uint32_t)(int_flag & DAC_INT_FLAG_MASK0);
    }else{
        /* illegal parameters */
    }

    /* check FIFO overflow and underflow interrupt int_flag */
    if(int_flag & DAC_INT_FLAG_MASK1)
    {
        DAC_STAT1(dac_periph) = (uint32_t)(int_flag & DAC_INT_FLAG_MASK1);
    }else{
        /* illegal parameters */
    }
}
